Vulintus/Vulintus_Board_Definitions/hardware/samd/0.2.0/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


menu.pcb_ver=Circuit Board Version
menu.ball_diameter=Ball Diameter

########################################################################################################################
# HabiTrak Thermal Activity Monitor (HT-TH)
# -----------------

habitrak_thermal_activity_monitor.name=HabiTrak Thermal Activity Monitor (HT-TH)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4325, submitted by Drew on 2022-02-02
habitrak_thermal_activity_monitor.vid.0=0x04D8
habitrak_thermal_activity_monitor.pid.0=0xE6C2
habitrak_thermal_activity_monitor.build.vid=0x04D8
habitrak_thermal_activity_monitor.build.pid=0xE6C2

# Upload
# MOVED TO MENU: habitrak_thermal_activity_monitor.upload.maximum_size=520192
habitrak_thermal_activity_monitor.upload.native_usb=true
habitrak_thermal_activity_monitor.upload.offset=0x4000
habitrak_thermal_activity_monitor.upload.protocol=sam-ba
habitrak_thermal_activity_monitor.upload.tool=bossac18
habitrak_thermal_activity_monitor.upload.use_1200bps_touch=true
habitrak_thermal_activity_monitor.upload.wait_for_upload_port=true

# Build
habitrak_thermal_activity_monitor.build.board=HABITRAK
habitrak_thermal_activity_monitor.build.cache_flags=-DENABLE_CACHE
habitrak_thermal_activity_monitor.build.core=arduino
# MOVED TO MENU: habitrak_thermal_activity_monitor.build.extra_flags=-D__SAMD51__ -D__SAMD51P19A__ -DVULINTUS_HABITRAK {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
habitrak_thermal_activity_monitor.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
habitrak_thermal_activity_monitor.build.flags.optimize=-Os
habitrak_thermal_activity_monitor.build.f_cpu=120000000L
habitrak_thermal_activity_monitor.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
habitrak_thermal_activity_monitor.build.mcu=cortex-m4
# MOVED TO MENU: habitrak_thermal_activity_monitor.build.openocdscript=openocd_scripts/habitrak_v1_0.cfg
# MOVED TO MENU: habitrak_thermal_activity_monitor.build.usb_product="HabiTrak V1.0"
habitrak_thermal_activity_monitor.build.usb_manufacturer="Vulintus"
# MOVED TO MENU: habitrak_thermal_activity_monitor.build.variant=habitrak_v1_0
habitrak_thermal_activity_monitor.build.variant_system_lib=

# Bootloader
# MOVED TO MENU: habitrak_thermal_activity_monitor.bootloader.file=samd51x19a/bootloader_samd51x19a.bin
habitrak_thermal_activity_monitor.bootloader.tool=openocd

# Compiler
habitrak_thermal_activity_monitor.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_0=Version 1.0
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_0.upload.maximum_size=520192
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_0.build.extra_flags=-D__SAMD51__ -D__SAMD51P19A__ -DVULINTUS_HABITRAK {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_0.build.openocdscript=openocd_scripts/habitrak_v1_0.cfg
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_0.build.usb_product="Version 1.0"
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_0.build.variant=habitrak_v1_0
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_0.bootloader.file=samd51x19a/bootloader_samd51x19a.bin

habitrak_thermal_activity_monitor.menu.pcb_ver.v1_1=Version 1.1
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_1.upload.maximum_size=520192
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_1.build.extra_flags=-D__SAMD51__ -D__SAMD51P19A__ -DVULINTUS_HABITRAK {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_1.build.openocdscript=openocd_scripts/habitrak_v1_1.cfg
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_1.build.usb_product="Version 1.1"
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_1.build.variant=habitrak_v1_1
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_1.bootloader.file=samd51x19a/bootloader_samd51x19a.bin

habitrak_thermal_activity_monitor.menu.pcb_ver.v1_2=Version 1.2
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_2.upload.maximum_size=520192
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_2.build.extra_flags=-D__SAMD51__ -D__SAMD51P19A__ -DVULINTUS_HABITRAK {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_2.build.openocdscript=openocd_scripts/habitrak_v1_2.cfg
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_2.build.usb_product="Version 1.2"
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_2.build.variant=habitrak_v1_2
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_2.bootloader.file=samd51x19a/bootloader_samd51x19a.bin

habitrak_thermal_activity_monitor.menu.pcb_ver.v1_3=Version 1.3
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_3.upload.maximum_size=520192
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_3.build.extra_flags=-D__SAMD51__ -D__SAMD51P19A__ -DVULINTUS_HABITRAK {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_3.build.openocdscript=openocd_scripts/habitrak_v1_3.cfg
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_3.build.usb_product="Version 1.3"
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_3.build.variant=habitrak_v1_3
habitrak_thermal_activity_monitor.menu.pcb_ver.v1_3.bootloader.file=samd51x19a/bootloader_samd51x19a.bin

# Parameter options formerly set with the menu:
# habitrak_thermal_activity_monitor.build.cache_flags=-DENABLE_CACHE
# habitrak_thermal_activity_monitor.build.cache_flags=
# habitrak_thermal_activity_monitor.build.flags.debug=-g
# habitrak_thermal_activity_monitor.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
# habitrak_thermal_activity_monitor.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
# habitrak_thermal_activity_monitor.build.flags.optimize=-Os
# habitrak_thermal_activity_monitor.build.flags.optimize=-O2
# habitrak_thermal_activity_monitor.build.flags.optimize=-O3
# habitrak_thermal_activity_monitor.build.flags.optimize=-Ofast
# habitrak_thermal_activity_monitor.build.flags.optimize=-Ofast -funroll-loops
# habitrak_thermal_activity_monitor.build.flags.usbstack=-DUSE_TINYUSB
# habitrak_thermal_activity_monitor.build.f_cpu=120000000L
# habitrak_thermal_activity_monitor.build.f_cpu=150000000L
# habitrak_thermal_activity_monitor.build.f_cpu=180000000L
# habitrak_thermal_activity_monitor.build.f_cpu=200000000L


########################################################################################################################
# MotoTrak Spherical Treadmill (MT-ST)
# ------------------------------

mototrak_spherical_treadmill.name=MotoTrak Spherical Treadmill (MT-ST)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4626, submitted by Drew on 2024-06-28
mototrak_spherical_treadmill.vid.0=0x04D8
mototrak_spherical_treadmill.pid.0=0xE59E
mototrak_spherical_treadmill.build.vid=0x04D8
mototrak_spherical_treadmill.build.pid=0xE59E

# Upload
mototrak_spherical_treadmill.upload.tool=bossac18
mototrak_spherical_treadmill.upload.protocol=sam-ba
mototrak_spherical_treadmill.upload.maximum_size=262144
mototrak_spherical_treadmill.upload.offset=0x2000
mototrak_spherical_treadmill.upload.use_1200bps_touch=true
mototrak_spherical_treadmill.upload.wait_for_upload_port=true
mototrak_spherical_treadmill.upload.native_usb=true

# Build
mototrak_spherical_treadmill.build.mcu=cortex-m0plus
mototrak_spherical_treadmill.build.f_cpu=48000000L
mototrak_spherical_treadmill.build.flags.optimize=-Os
mototrak_spherical_treadmill.build.usb_manufacturer="Vulintus"
mototrak_spherical_treadmill.build.board=SPHERICAL_TREADMILL
mototrak_spherical_treadmill.build.core=arduino
mototrak_spherical_treadmill.build.extra_flags=-DCRYSTALLESS -D__SAMD21__ -D__SAMD21E18A__ -DVULINTUS_MOTOTRAK_SPHERICAL_TREADMILL -DARM_MATH_CM0PLUS {build.usb_flags}
mototrak_spherical_treadmill.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mototrak_spherical_treadmill.build.variant_system_lib=

# Bootloader
mototrak_spherical_treadmill.bootloader.tool=openocd
mototrak_spherical_treadmill.bootloader.file=samd21x18a/bootloader_samd21x18a.bin

# Menu (PCB Version)
mototrak_spherical_treadmill.menu.pcb_ver.v0_1=Version 0.1
mototrak_spherical_treadmill.menu.pcb_ver.v0_1.build.variant=mototrak_spherical_treadmill_v0_1
mototrak_spherical_treadmill.menu.pcb_ver.v0_1.build.openocdscript=openocd_scripts/mototrak_spherical_treadmill_v0_1.cfg
mototrak_spherical_treadmill.menu.pcb_ver.v0_1.build.usb_product="Version 0.1"

# Menu (Ball Diameter)
mototrak_spherical_treadmill.menu.ball_diameter.195p5mm=195.5mm
mototrak_spherical_treadmill.menu.ball_diameter.195p5mm.build.flags.hwver=-DMTST_BALL_DIAM=195.5 -DMTST_THETA1=120 -DMTST_THETA2=-60 -DMTST_PHI=-40 -DMTST_SENSOR_ANGLE=45


########################################################################################################################
# OmniTrak Common Controller (OT-CC)
# ----------------------------

omnitrak_common_controller.name=OmniTrak Common Controller (OT-CC)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4289, submitted by Drew on 2022-01-13
omnitrak_common_controller.vid.0=0x04D8    
omnitrak_common_controller.pid.0=0xE6C3    
omnitrak_common_controller.build.vid=0x04D8
omnitrak_common_controller.build.pid=0xE6C3

# Upload
omnitrak_common_controller.upload.offset=0x4000
omnitrak_common_controller.upload.protocol=sam-ba
omnitrak_common_controller.upload.maximum_size=1032192
omnitrak_common_controller.upload.tool=bossac18
omnitrak_common_controller.upload.use_1200bps_touch=true
omnitrak_common_controller.upload.wait_for_upload_port=true
omnitrak_common_controller.upload.native_usb=true

# Build
omnitrak_common_controller.build.board=OMNITRAK_CONTROLLER
omnitrak_common_controller.build.cache_flags=-DENABLE_CACHE
omnitrak_common_controller.build.core=arduino
omnitrak_common_controller.build.extra_flags=-D__SAMD51__ -D__SAMD51P20A__ -DVULINTUS_OMNITRAK_CONTROLLER -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
omnitrak_common_controller.build.flags.optimize=-Os
omnitrak_common_controller.build.f_cpu=120000000L
omnitrak_common_controller.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
omnitrak_common_controller.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
omnitrak_common_controller.build.mcu=cortex-m4
omnitrak_common_controller.build.usb_manufacturer="Vulintus"
omnitrak_common_controller.build.variant_system_lib=

# Bootloader
omnitrak_common_controller.bootloader.tool=openocd
omnitrak_common_controller.bootloader.file=samd51x20a/bootloader_samd51x20a.bin

