Vulintus/Vulintus_Board_Definitions/hardware/samd/0.2.0/boards.txt
# Compiler
omnitrak_common_controller.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu
omnitrak_common_controller.menu.pcb_ver.v2_0=Version 2.0
omnitrak_common_controller.menu.pcb_ver.v2_0.build.variant=omnitrak_controller_v2_0
omnitrak_common_controller.menu.pcb_ver.v2_0.build.openocdscript=openocd_scripts/omnitrak_controller_v2_0.cfg
omnitrak_common_controller.menu.pcb_ver.v2_0.build.usb_product="Version 2.0"

omnitrak_common_controller.menu.pcb_ver.v2_1=Version 2.1
omnitrak_common_controller.menu.pcb_ver.v2_1.build.variant=omnitrak_controller_v2_1
omnitrak_common_controller.menu.pcb_ver.v2_1.build.openocdscript=openocd_scripts/omnitrak_controller_v2_1.cfg
omnitrak_common_controller.menu.pcb_ver.v2_1.build.usb_product="Version 2.1"

omnitrak_common_controller.menu.pcb_ver.v2_2=Version 2.2
omnitrak_common_controller.menu.pcb_ver.v2_2.build.variant=omnitrak_controller_v2_2
omnitrak_common_controller.menu.pcb_ver.v2_2.build.openocdscript=openocd_scripts/omnitrak_controller_v2_2.cfg
omnitrak_common_controller.menu.pcb_ver.v2_2.build.usb_product="Version 2.2"

omnitrak_common_controller.menu.pcb_ver.ble=BLE Test
omnitrak_common_controller.menu.pcb_ver.ble.build.variant=omnitrak_controller_ble
omnitrak_common_controller.menu.pcb_ver.ble.build.openocdscript=openocd_scripts/omnitrak_controller_ble.cfg
omnitrak_common_controller.menu.pcb_ver.ble.build.usb_product="BLE TEST"

# Parameter options formerly set with the menu:
# omnitrak_common_controller.build.cache_flags=-DENABLE_CACHE
# omnitrak_common_controller.build.cache_flags=
# omnitrak_common_controller.build.flags.debug=-g
# omnitrak_common_controller.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
# omnitrak_common_controller.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
# omnitrak_common_controller.build.flags.optimize=-Os
# omnitrak_common_controller.build.flags.optimize=-O2
# omnitrak_common_controller.build.flags.optimize=-O3
# omnitrak_common_controller.build.flags.optimize=-Ofast
# omnitrak_common_controller.build.flags.optimize=-Ofast -funroll-loops
# omnitrak_common_controller.build.flags.usbstack=-DUSE_TINYUSB
# omnitrak_common_controller.build.f_cpu=120000000L
# omnitrak_common_controller.build.f_cpu=150000000L
# omnitrak_common_controller.build.f_cpu=180000000L
# omnitrak_common_controller.build.f_cpu=200000000L


########################################################################################################################
# OmniTrak Social Choice Module (OT-SC)
# ------------------------------

omnitrak_social_choice.name=OmniTrak Social Choice Module (OT-SC)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4754, submitted by Drew on 2025-01-01
omnitrak_social_choice.vid.0=0x04D8
omnitrak_social_choice.pid.0=0xE52F
omnitrak_social_choice.build.vid=0x04D8
omnitrak_social_choice.build.pid=0xE52F

# Upload
omnitrak_social_choice.upload.tool=bossac18
omnitrak_social_choice.upload.protocol=sam-ba
omnitrak_social_choice.upload.maximum_size=262144
omnitrak_social_choice.upload.offset=0x2000
omnitrak_social_choice.upload.use_1200bps_touch=true
omnitrak_social_choice.upload.wait_for_upload_port=true
omnitrak_social_choice.upload.native_usb=true

# Build
omnitrak_social_choice.build.mcu=cortex-m0plus
omnitrak_social_choice.build.f_cpu=48000000L
omnitrak_social_choice.build.flags.optimize=-Os
omnitrak_social_choice.build.usb_manufacturer="Vulintus"
omnitrak_social_choice.build.board=SOCIAL_CHOICE_MODULE
omnitrak_social_choice.build.core=arduino
omnitrak_social_choice.build.extra_flags=-DCRYSTALLESS -D__SAMD21__ -D__SAMD21E18A__ -DVULINTUS_OMNITRAK_SOCIAL_CHOICE -DARM_MATH_CM0PLUS {build.usb_flags}
omnitrak_social_choice.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
omnitrak_social_choice.build.variant_system_lib=

# Bootloader
omnitrak_social_choice.bootloader.tool=openocd
omnitrak_social_choice.bootloader.file=samd21x18a/bootloader_samd21x18a.bin

# Menu
omnitrak_social_choice.menu.pcb_ver.v0_1=Version 0.1
omnitrak_social_choice.menu.pcb_ver.v0_1.build.variant=omnitrak_social_choice_v0_1
omnitrak_social_choice.menu.pcb_ver.v0_1.build.openocdscript=openocd_scripts/omnitrak_social_choice_v0_1.cfg
omnitrak_social_choice.menu.pcb_ver.v0_1.build.usb_product="Version 0.1"


########################################################################################################################
# VPB Linear Autopositioner (PB-LA)
# ------------------------------

vpb_linear_autopositioner.name=VPB Linear Autopositioner (PB-LA)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4325, submitted by Drew on 2023-02-02
vpb_linear_autopositioner.vid.0=0x04D8
vpb_linear_autopositioner.pid.0=0xE6AC
vpb_linear_autopositioner.build.vid=0x04D8
vpb_linear_autopositioner.build.pid=0xE6AC

# Upload
vpb_linear_autopositioner.upload.tool=bossac18
vpb_linear_autopositioner.upload.protocol=sam-ba
vpb_linear_autopositioner.upload.maximum_size=122880
vpb_linear_autopositioner.upload.offset=0x2000
vpb_linear_autopositioner.upload.use_1200bps_touch=true
vpb_linear_autopositioner.upload.wait_for_upload_port=true
vpb_linear_autopositioner.upload.native_usb=true

# Build
vpb_linear_autopositioner.build.mcu=cortex-m0plus
vpb_linear_autopositioner.build.f_cpu=48000000L
vpb_linear_autopositioner.build.cache_flags=-DENABLE_CACHE
vpb_linear_autopositioner.build.flags.optimize=-Os
vpb_linear_autopositioner.build.usb_manufacturer="Vulintus"
vpb_linear_autopositioner.build.board=LINEAR_AUTOPOSITIONER
vpb_linear_autopositioner.build.core=arduino
vpb_linear_autopositioner.build.extra_flags=-D__SAMD21__ -D__SAMD21G17A__ -DVULINTUS_VPB_LINEAR_AUTOPOSITIONER -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
vpb_linear_autopositioner.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vpb_linear_autopositioner.build.variant_system_lib=

# Bootloader
vpb_linear_autopositioner.bootloader.tool=openocd
vpb_linear_autopositioner.bootloader.file=samd21x17a/bootloader_samd21x17a.bin

# Menu
vpb_linear_autopositioner.menu.pcb_ver.v2_1=Version 2.1
vpb_linear_autopositioner.menu.pcb_ver.v2_1.build.variant=linear_autopositioner_v2_1
vpb_linear_autopositioner.menu.pcb_ver.v2_1.build.openocdscript=openocd_scripts/linear_autopositioner_v2_1.cfg
vpb_linear_autopositioner.menu.pcb_ver.v2_1.build.usb_product="Version 2.1"


########################################################################################################################
# VPB Liquid Dispenser (PB-LD)
# -------------------------

vpb_liquid_dispenser.name=VPB Liquid Dispenser (PB-LD)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4470, submitted by Drew on 2023-10-09
vpb_liquid_dispenser.vid.0=0x04D8
vpb_liquid_dispenser.pid.0=0xE62E
vpb_liquid_dispenser.build.vid=0x04D8
vpb_liquid_dispenser.build.pid=0xE62E

# Upload
vpb_liquid_dispenser.upload.tool=bossac18
vpb_liquid_dispenser.upload.protocol=sam-ba
vpb_liquid_dispenser.upload.maximum_size=122880
vpb_liquid_dispenser.upload.maximum_data_size=16384
vpb_liquid_dispenser.upload.offset=0x2000
vpb_liquid_dispenser.upload.use_1200bps_touch=true
vpb_liquid_dispenser.upload.wait_for_upload_port=true
vpb_liquid_dispenser.upload.native_usb=true

# Build
vpb_liquid_dispenser.build.mcu=cortex-m0plus
vpb_liquid_dispenser.build.f_cpu=48000000L
vpb_liquid_dispenser.build.cache_flags=-DENABLE_CACHE
vpb_liquid_dispenser.build.flags.optimize=-Os
vpb_liquid_dispenser.build.usb_manufacturer="Vulintus"
vpb_liquid_dispenser.build.board=LIQUID_DISPENSER
vpb_liquid_dispenser.build.core=arduino
vpb_liquid_dispenser.build.extra_flags=-D__SAMD21__  -D__SAMD21G17A__ -DVULINTUS_VPB_LIQUID_DISPENSER -DCRYSTALLESS -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
vpb_liquid_dispenser.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vpb_liquid_dispenser.build.variant_system_lib=

# Bootloader
vpb_liquid_dispenser.bootloader.tool=openocd
vpb_liquid_dispenser.bootloader.file=samd21x17a/bootloader_samd21x17a.bin

# Menu
vpb_liquid_dispenser.menu.pcb_ver.v2_0=Version 2.0
vpb_liquid_dispenser.menu.pcb_ver.v2_0.build.variant=vpb_liquid_dispenser_v2_0
vpb_liquid_dispenser.menu.pcb_ver.v2_0.build.openocdscript=openocd_scripts/vpb_liquid_dispenser_v2_0.cfg
vpb_liquid_dispenser.menu.pcb_ver.v2_0.build.usb_product="Version 2.0"

vpb_liquid_dispenser.menu.pcb_ver.v2_1=Version 2.1
vpb_liquid_dispenser.menu.pcb_ver.v2_1.build.variant=vpb_liquid_dispenser_v2_1
vpb_liquid_dispenser.menu.pcb_ver.v2_1.build.openocdscript=openocd_scripts/vpb_liquid_dispenser_v2_1.cfg
vpb_liquid_dispenser.menu.pcb_ver.v2_1.build.usb_product="Version 2.1"


########################################################################################################################
# VPB Pellet Dispenser (PB-PD)
# -------------------------

vpb_pellet_dispenser.name=VPB Pellet Dispenser (PB-LD)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4753, submitted by Drew on 2025-01-01
vpb_pellet_dispenser.vid.0=0x04D8
vpb_pellet_dispenser.pid.0=0xE530
vpb_pellet_dispenser.build.vid=0x04D8
vpb_pellet_dispenser.build.pid=0xE530

# Upload
vpb_pellet_dispenser.upload.tool=bossac18
vpb_pellet_dispenser.upload.protocol=sam-ba
vpb_pellet_dispenser.upload.maximum_size=262144
vpb_pellet_dispenser.upload.maximum_data_size=32768
vpb_pellet_dispenser.upload.offset=0x2000
vpb_pellet_dispenser.upload.use_1200bps_touch=true
vpb_pellet_dispenser.upload.wait_for_upload_port=true
vpb_pellet_dispenser.upload.native_usb=true

# Build
vpb_pellet_dispenser.build.mcu=cortex-m0plus
vpb_pellet_dispenser.build.f_cpu=48000000L
vpb_pellet_dispenser.build.cache_flags=-DENABLE_CACHE
vpb_pellet_dispenser.build.flags.optimize=-Os
vpb_pellet_dispenser.build.usb_manufacturer="Vulintus"
vpb_pellet_dispenser.build.board=PELLET_DISEPNSER
vpb_pellet_dispenser.build.core=arduino
vpb_pellet_dispenser.build.extra_flags=-D__SAMD21__  -D__SAMD21G18A__ -DVULINTUS_VPB_PELLET_DISPENSER -DCRYSTALLESS -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
vpb_pellet_dispenser.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vpb_pellet_dispenser.build.variant_system_lib=

# Bootloader
vpb_pellet_dispenser.bootloader.tool=openocd
vpb_pellet_dispenser.bootloader.file=samd21x17a/bootloader_samd21x17a.bin

# Menu
vpb_pellet_dispenser.menu.pcb_ver.v2_0=Version 6.0
vpb_pellet_dispenser.menu.pcb_ver.v2_0.build.variant=vpb_pellet_dispenser_v6_0
vpb_pellet_dispenser.menu.pcb_ver.v2_0.build.openocdscript=openocd_scripts/vpb_pellet_dispenser_v6_0.cfg
vpb_pellet_dispenser.menu.pcb_ver.v2_0.build.usb_product="Version 6.0"


########################################################################################################################
# VPB Ring Light (PB-RL)
# -------------------

